{"kind":"Notebook","sha256":"b4740546b611b7f1c9edd8a15ab6c4162e76ad0315b71ecf41ac78c3db1627b0","slug":"grein","dependencies":[],"frontmatter":{"title":"Geneset: Pangenomic and synteny analysis of Thermus species","date":"01-01-2023","exports":[{"format":"md","filename":"grein.md","url":"/grein/build/grein-7ac2a71d05876b5d7ba29fbabda2c06b.md"},{"format":"docx","article":"/Users/sigmar/Documents/GitHub/grein/grein.md","filename":"grein.docx","url":"/grein/build/grein-dc14a96428aabb4b00705b53afdf855e.docx"},{"format":"pdf","article":"/Users/sigmar/Documents/GitHub/grein/grein.md","filename":"grein.pdf","url":"/grein/build/grein-45c86541fc1ee83d2bd0981d8c168044.pdf"}],"jupytext":{"text_representation":{"extension":".md","format_name":"myst","format_version":"0.13","jupytext_version":"1.14.5"}},"authors":[{"name":"Sigmar Stefánsson"},{"name":"Guðmundur Hreggviðsson"}],"github":"https://github.com/sigmarkarl/notebooks","keywords":["pangenomics","microbial genomics","whole genome sequencing","bioinformatics"],"thumbnail":"/grein/build/islands-20d05c58ebe192c8165c4452810117ae.pdf","thumbnailOptimized":"/grein/build/islands-20d05c58ebe192c8165c4452810117ae.webp"},"mdast":{"type":"root","children":[{"type":"block","children":[{"type":"heading","depth":3,"position":{"start":{"line":18,"column":0},"end":{"line":19,"column":0}},"children":[{"type":"text","value":"Abstract","key":"ACuHULH9y9"}],"identifier":"abstract","label":"Abstract","html_id":"abstract","implicit":true,"key":"fJcCR9pogm"},{"type":"paragraph","position":{"start":{"line":20,"column":0},"end":{"line":21,"column":0}},"children":[{"type":"strong","children":[{"type":"text","value":"Background","key":"T78xd4TuV2"}],"key":"eqIQozOBIS"},{"type":"text","value":": Pan-genomic analysis allows for a more comprehensive understanding of the genetic diversity within a species, as well as the identification of unique genomic features that contribute to phenotypic traits and evolutionary adaptation. Pan-genomics software development has been driven by the increasing availability of genome sequencing data, as well as the need to analyze and compare large-scale genomic datasets efficiently. These tools are essential for various applications, including microbial genomics, comparative genomics, evolutionary studies, and genome-wide association studies.","key":"qUwA7F0Wfh"}],"key":"G0MegizP5t"},{"type":"paragraph","position":{"start":{"line":22,"column":0},"end":{"line":23,"column":0}},"children":[{"type":"strong","children":[{"type":"text","value":"Results","key":"BPhITuaqVT"}],"key":"aUmxWTffvE"},{"type":"text","value":": We present Geneset, a desktop application written in Java providing algorithms and advanced visualization for comparative and pan-genomics. It analyses synteny and structural patterns using pan-genome graphs. The software is built upon Apache Spark cloud computing environment and is scalable as such. Geneset uses a suite of external open source command line tools.","key":"PxsIYEFDW2"}],"key":"Yzq62v7GgW"},{"type":"paragraph","position":{"start":{"line":24,"column":0},"end":{"line":25,"column":0}},"children":[{"type":"strong","children":[{"type":"text","value":"Conclusions","key":"wN3XzxjTH7"}],"key":"CsqY3m33oI"},{"type":"text","value":": Although possible to be run in a headless mode as part of a workflow/pipeline or as a database accessible from a Spark context, the Geneset software suite offers a rich UI and unprecedented graphics capabilities, such as visualization of synteny using colors, genome atlases and phylogeny comparisons. The program offers automatic reordering of contigs. The interactive mode manual curation of results easier. We show that the difference in genomic features in Thermus are responsible for divergence and different adaptations.","key":"V570U2CRvH"}],"key":"RsOyMBH1Uh"},{"type":"paragraph","position":{"start":{"line":26,"column":0},"end":{"line":27,"column":0}},"children":[{"type":"strong","children":[{"type":"text","value":"Keywords","key":"CbBCggR6p7"}],"key":"j2zI9yMy48"},{"type":"text","value":": pangenomics, microbial genomics, whole genome sequencing, bioinformatics","key":"BHdc00z0o9"}],"key":"QkChxZzW46"}],"key":"XxoyqkxAeU"},{"type":"block","position":{"start":{"line":28,"column":0},"end":{"line":29,"column":0}},"children":[{"type":"heading","depth":3,"position":{"start":{"line":30,"column":0},"end":{"line":31,"column":0}},"children":[{"type":"text","value":"Background","key":"XTwn3Iou3W"}],"identifier":"background","label":"Background","html_id":"background","implicit":true,"key":"OBiErCPhP6"},{"type":"paragraph","position":{"start":{"line":32,"column":0},"end":{"line":33,"column":0}},"children":[{"type":"text","value":"A single genome does not represent the full range of genetic diversity within a species, as it only provides information about one individual or strain. In contrast, pan-genomics can identify and analyze genetic variations across multiple strains, revealing insights into the genomic diversity and evolutionary history of a population.","key":"ENBt2aTt8I"}],"key":"xtMblV3reP"},{"type":"paragraph","position":{"start":{"line":34,"column":0},"end":{"line":37,"column":0}},"children":[{"type":"text","value":"Additionally, pan-genomics allows for the identification of accessory genes, which are not present in all individuals of a species but may contribute to virulence, antibiotic resistance, and other phenotypic traits. These genes may be missed in the analysis of a single genome but can be identified through pan-genomics software.\nThis information can provide insights into the origin, migration, and diversification of a species.\nHere we describe Geneset, a software suite for pangenomics analysis. By using the Apache Spark cloud computing software as a basis the processes can be easily scaled and run in the cloud. Most cloud venders offer Spark as a cloud computing runtime. Spark also gives access to a wealth of highly optimized algorithms with a standard usage pattern. The main concept in Geneset is the Set. Homologous genes or groups of homologous clusters, their intersections and unions represent the core, accessory, shell and cloud genomes.","key":"G2JcrievsS"}],"key":"WMqJ1MDKcE"},{"type":"paragraph","position":{"start":{"line":38,"column":0},"end":{"line":39,"column":0}},"children":[{"type":"text","value":"Visualization is an essential component of science as it allows researchers to communicate complex data and concepts in a clear and accessible manner. Visualization tools and techniques enable scientists to analyze, interpret, and communicate their findings effectively, enhancing scientific understanding and discovery. Visualization tools can help scientists to discover patterns, relationships, and correlations that may be difficult to identify from raw data. Interactive visualizations can enable researchers to manipulate and explore data in new ways, uncovering hidden trends and patterns that may lead to new insights and discoveries.","key":"oXVCraeqFL"}],"key":"cpYwz5Mn3d"}],"key":"hxBG5evLcC"},{"type":"block","position":{"start":{"line":40,"column":0},"end":{"line":41,"column":0}},"children":[{"type":"heading","depth":3,"position":{"start":{"line":42,"column":0},"end":{"line":43,"column":0}},"children":[{"type":"text","value":"Implementation","key":"s46vE3xUqJ"}],"identifier":"implementation","label":"Implementation","html_id":"implementation","implicit":true,"key":"a6wExB5tHs"},{"type":"paragraph","position":{"start":{"line":44,"column":0},"end":{"line":45,"column":0}},"children":[{"type":"text","value":"Geneset takes as an input a project directory or zip file containing genbank files and/or fasta genome sequence files. After running a series of preprocessing steps, 4 result tables produced. These are the Annotation, GeneGroup, Islands and Functions tables and are SQL queriable and accessible via any tool supporting JDBC connections. All subsequent result and metadata files are saved to the project directory/zip file. A DataSource for genbank ('gbk') files was created for Apache Spark and the software can be loaded into existing Spark environment as a library.","key":"hUzlKTC1L7"}],"key":"BUC1eNGGPz"},{"type":"paragraph","position":{"start":{"line":46,"column":0},"end":{"line":47,"column":0}},"children":[{"type":"text","value":"Geneset can automatically search for and fetch annotated bacterial genomes from the NCBI (.gbff files). In addition to publicly available strains the user can include assembled fasta files from novel strains. These can optionally be run through the PGAP annotation pipeline if installed on the same machine. The genbank result files are compressed into a single zip archive or a directory constituting to a project in Geneset. Geneset uses the zip format for all input files, associated metadata and derived data from calculation and image generation. Hence, a zip file is a single project in Geneset containing all the genomes and metadata produced by the software. Geneset loads the genes and CDS's from all the genbank files into a main gene set table. If PGAP is not used for annotation, Prodigal is used to identify the genes on the sequence contigs from fasta files of sequence contigs.","key":"pW9vKuPhBw"}],"key":"aznfAbJBOC"},{"type":"paragraph","position":{"start":{"line":48,"column":0},"end":{"line":49,"column":0}},"children":[{"type":"text","value":"Central to Geneset is gene set concept. A gene set can be a group of homologous genes or a island/cassette of genes in a region. Describing the functionality of the software we will use a example project of 100 strains from the bacterial genus Thermus along with smaller separate a Thermus phage project. After importing genome data into the project and doing preliminary annotations a few preprocessing steps need to be run. Additional annotation can be run after the preprocessing.","key":"jrxJx92owo"}],"key":"JDvsEyIGzM"},{"type":"heading","depth":4,"position":{"start":{"line":50,"column":0},"end":{"line":51,"column":0}},"children":[{"type":"text","value":"Preprocessing","key":"OsOQmL0R1g"}],"identifier":"preprocessing","label":"Preprocessing","html_id":"preprocessing","implicit":true,"key":"WvhtNuHCCe"},{"type":"paragraph","position":{"start":{"line":51,"column":0},"end":{"line":52,"column":0}},"children":[{"type":"text","value":"Geneset requires four data preparation steps before the genomes can be compared, analysed and vizualized. The steps are 1. Gene clustering, 2. Multiple Sequence Alignment (MSA), 3. Synteny analysis and island identification and 4. Phylogeny. The four tasks depend on third party software such as ","key":"DIPCwXwMXa"},{"type":"cite","url":"https://doi.org/10.1038/s41592-021-01101-x","children":[{"type":"text","value":"Blast/Diamond","key":"XiJuhtcqrS"}],"urlSource":"https://doi.org/10.1038/s41592-021-01101-x","data":{"doi":"10.1038/s41592-021-01101-x"},"internal":false,"protocol":"doi","kind":"narrative","label":"Buchfink_2021","key":"UzMZjKdIlO"},{"type":"text","value":", ","key":"oejCyy4xeM"},{"type":"cite","url":"https://doi.org/10.1093/nar/gkf436","children":[{"type":"text","value":"MAFFT","key":"eaIHYHXbMj"}],"urlSource":"https://doi.org/10.1093/nar/gkf436","data":{"doi":"10.1093/nar/gkf436"},"internal":false,"protocol":"doi","kind":"narrative","label":"Katoh_2002","key":"zVdxGzeECm"},{"type":"text","value":" and ","key":"NbTfiZFknc"},{"type":"cite","url":"https://doi.org/10.1371/journal.pone.0009490","children":[{"type":"text","value":"FastTree","key":"iEfQg0VQhq"}],"urlSource":"https://doi.org/10.1371/journal.pone.0009490","data":{"doi":"10.1371/journal.pone.0009490"},"internal":false,"protocol":"doi","kind":"narrative","label":"Price_2010","key":"NZusmjPFZM"},{"type":"text","value":". Apache Spark is used to parallelize the preprocessing tasks.","key":"cJZBIWSPfg"}],"key":"UodSG0Kcp9"},{"type":"heading","depth":4,"position":{"start":{"line":53,"column":0},"end":{"line":54,"column":0}},"children":[{"type":"text","value":"Gene clustering","key":"G3UnybNltZ"}],"identifier":"gene-clustering","label":"Gene clustering","html_id":"gene-clustering","implicit":true,"key":"vFOEe28Jo1"},{"type":"paragraph","position":{"start":{"line":54,"column":0},"end":{"line":55,"column":0}},"children":[{"type":"text","value":"To prepare for comparative analysis of the genomes in the project, the first step is to run the \"Group genes\" pipeline. This task translates to a Spark map/reduce process that uses NCBI blast or diamond (with a blast compatible output) to join homolog genes. A blast/diamond protein database with all the genes in the project is created. A Spark dataset of protein fasta entries is generated for each gene. The unique gene id from the genbank files is used to identify the genes. By default, each species or a contig is a single partition in the Spark gene dataset but the user can change the number of partitions depending on the size of the data and compute cluster. The default criteria for joining two genes is the 50/50 rule. That means, at least 50% of the gene length must have 50% identity with the comparing sequence. For metagenomic analysis or viral genomes a less stringent values might be suitable, such as 25/50. A map step on the gene spark datasets maps each fasta entry to a group of gene ids from the blast/diamond run. The final reduce step joins all the groups that have common entries. The result is saved into the project zip file as a text file containing comma separated list of all gene ids in a group per line. This step is computationally expensive compared to other clustering approaches in pan genomes, such as MCL. Doing an all against all blast is much more accurate though and within the scope of bacterial analysis, especially when using cloud computing environments such as Apache Spark.","key":"vOZwvSvJ9q"}],"key":"Y2OqFOb3Oq"},{"type":"heading","depth":4,"position":{"start":{"line":56,"column":0},"end":{"line":57,"column":0}},"children":[{"type":"text","value":"MSA","key":"Zq08KVA8ri"}],"identifier":"msa","label":"MSA","html_id":"msa","implicit":true,"key":"N5K1CgRTa4"},{"type":"paragraph","position":{"start":{"line":57,"column":0},"end":{"line":58,"column":0}},"children":[{"type":"text","value":"The main Geneset table has now been reduced (from around 200000 gene entries to 8500 gene families in a project using 100 Thermus strains). Each row now represents a set of homologus genes. The next step is to run multiple sequence alignment (MSA) on all the groups. For this we use the ","key":"lureqGDVXH"},{"type":"cite","url":"https://doi.org/10.1093/nar/gkf436","children":[{"type":"text","value":"MAFFT","key":"pDcqdWf8ir"}],"urlSource":"https://doi.org/10.1093/nar/gkf436","data":{"doi":"10.1093/nar/gkf436"},"internal":false,"protocol":"doi","kind":"narrative","label":"Katoh_2002","key":"mXOEiOYKcf"},{"type":"text","value":" multiple alignment software. Again a Spark dataset is created, now with all the protein sequences in a group. The map step produces a fasta format that is fed into the ","key":"BIhn5rKOg4"},{"type":"cite","url":"https://doi.org/10.1093/nar/gkf436","children":[{"type":"text","value":"MAFFT","key":"LqWaN5yCfu"}],"urlSource":"https://doi.org/10.1093/nar/gkf436","data":{"doi":"10.1093/nar/gkf436"},"internal":false,"protocol":"doi","kind":"narrative","label":"Katoh_2002","key":"Z0MSTbx3X5"},{"type":"text","value":" algorithm. The resulting MSA fasta is saved into the project zip file (under the 'alignment' folder). Optional: HMMER Sequence profiles can be generated from all the gene groups if the user wants to use profile queries against the project data. The HMMER files are stored in the 'hmmer' folder.","key":"ONhfEY5cSr"}],"key":"J7welPmQCM"},{"type":"heading","depth":4,"position":{"start":{"line":59,"column":0},"end":{"line":60,"column":0}},"children":[{"type":"text","value":"Synteny cluster detection","key":"ivZts5cwiZ"}],"identifier":"synteny-cluster-detection","label":"Synteny cluster detection","html_id":"synteny-cluster-detection","implicit":true,"key":"CA1mrbS4c3"},{"type":"paragraph","position":{"start":{"line":60,"column":0},"end":{"line":61,"column":0}},"children":[{"type":"text","value":"Synteny in biology refers to the conservation of gene order and arrangement across different species or within a species. There are several reasons for the existence of synteny in biology:","key":"B1e9n385ez"}],"key":"q6TLxtcr7h"},{"type":"paragraph","position":{"start":{"line":62,"column":0},"end":{"line":63,"column":0}},"children":[{"type":"emphasis","children":[{"type":"text","value":"Evolutionary Conservation","key":"h4yuiYrBIs"}],"key":"tqGYavdAkX"},{"type":"text","value":": Synteny is often the result of evolutionary processes that conserve the organization of genes over time. It indicates that certain gene arrangements have been advantageous and maintained through natural selection because they contribute to the fitness or survival of the organism.","key":"sMX2Iv4Qgh"}],"key":"bPx3575O9B"},{"type":"paragraph","position":{"start":{"line":64,"column":0},"end":{"line":65,"column":0}},"children":[{"type":"emphasis","children":[{"type":"text","value":"Functional Relationships","key":"GQSJCmNPSr"}],"key":"KZUSszSExi"},{"type":"text","value":": Synteny can reflect functional relationships between genes. Genes located close to each other on a chromosome may have co-evolved and become functionally linked. This can occur when genes participate in the same biological pathway or are involved in coordinating specific cellular processes.","key":"QcWWXCkMXz"}],"key":"KOeGVj9Jej"},{"type":"paragraph","position":{"start":{"line":66,"column":0},"end":{"line":67,"column":0}},"children":[{"type":"emphasis","children":[{"type":"text","value":"Gene Regulation","key":"X92BFYdTOd"}],"key":"mgfm178VQ9"},{"type":"text","value":": Synteny can play a role in gene regulation. Regulatory elements that control gene expression, such as enhancers or silencers, may be located in close proximity to the genes they regulate. By maintaining synteny, the regulatory elements can be conserved along with the genes, ensuring proper gene expression patterns.","key":"iqxcdHvVuS"}],"key":"LLBeZI1TfG"},{"type":"paragraph","position":{"start":{"line":68,"column":0},"end":{"line":69,"column":0}},"children":[{"type":"emphasis","children":[{"type":"text","value":"Chromosomal Rearrangements","key":"Vh7dVVAvWL"}],"key":"No6y9Ip6SJ"},{"type":"text","value":": Synteny can be disrupted by chromosomal rearrangements, such as inversions, translocations, or duplications. However, the presence of synteny despite occasional rearrangements suggests that these rearrangements are relatively rare or have been counterbalanced by selection pressures, indicating the importance of maintaining gene order.","key":"Bm5CWHaa15"}],"key":"k3RUIi7wTr"},{"type":"paragraph","position":{"start":{"line":70,"column":0},"end":{"line":71,"column":0}},"children":[{"type":"text","value":"Comparative Genomics: Synteny is a valuable tool in comparative genomics. By comparing the gene order and organization across different species, researchers can infer evolutionary relationships, identify conserved regions, and gain insights into genome evolution. Synteny maps can aid in genome assembly, gene annotation, and the discovery of genetic variations associated with diseases.","key":"qff6MLOKdT"}],"key":"RCNg15QOTK"},{"type":"paragraph","position":{"start":{"line":72,"column":0},"end":{"line":73,"column":0}},"children":[{"type":"text","value":"Overall, the presence of synteny in biology can provide insights into the evolutionary history, functional relationships, and regulatory mechanisms of genes, and it serves as a valuable tool in comparative genomics. Each group of genes is stored as a node in a graph using Spark‘s GraphX capabilities. The edges are all possible paths to another set of genes within the project. The graph is undirected but each edge is annotated as a forward or backward edge depending on the direction of the gene. The direction annotations are only used for island identification and node collapsing. Once the genes in an islands have been joined in a single node, the graph can be treated as any other. The island identification is an iterative process. First all homologus genes with a single shared edge in the same direction are joined. Then, allowing for slight variations, four kinds of graph motifs are joined. A. replacements, B. inserts, C. flip and D. mixed. The reason for not treating every motif as D is that the motifs indicate different behavior in the genome. The images show the general pattern though the motifs can have any number of center nodes. For instance, motif A could be a single triangle.","key":"nEdaLCr0cF"}],"key":"EgG4Ebs0MR"},{"type":"image","url":"/grein/build/islands-20d05c58ebe192c8165c4452810117ae.png","alt":"islands","title":"islands","urlSource":"islands.pdf","urlOptimized":"/grein/build/islands-20d05c58ebe192c8165c4452810117ae.webp","key":"R6d9c64P0X"},{"type":"paragraph","position":{"start":{"line":76,"column":0},"end":{"line":77,"column":0}},"children":[{"type":"emphasis","children":[{"type":"text","value":"Graph motifs allowed when joining synteny breakpoints to islands","key":"LQxCaCFLyp"}],"key":"taTExyoAaF"}],"key":"ufGygiiugd"},{"type":"paragraph","position":{"start":{"line":78,"column":0},"end":{"line":79,"column":0}},"children":[{"type":"emphasis","children":[{"type":"strong","children":[{"type":"text","value":"Automatic Split/Merge","key":"ypaxTtMqO3"}],"key":"hFtscH9Frd"}],"key":"bZzPJvZ8U2"},{"type":"text","value":" Matifs A and B can also indicade non-biological events such as errors in sequencing or lack of data. In the case of matif A, if the two paths have the same annotatation or the sequence similarity falls within certain threshold, the groups can be automaticaly merged. Same applies for the 'reverse' motif, if two paths collapse into a single gene group. The group is split if the calculated sequence distances allow for spliting between the two paths.","key":"jLObBKXAB9"}],"key":"ULvr8By8Zj"},{"type":"image","url":"/grein/build/motifx-4120a720cf9f81b01480981f3cbce392.png","alt":"matifx","title":"motifx","urlSource":"motifx.pdf","urlOptimized":"/grein/build/motifx-4120a720cf9f81b01480981f3cbce392.webp","key":"fKO5PxHqio"},{"type":"paragraph","position":{"start":{"line":82,"column":0},"end":{"line":83,"column":0}},"children":[{"type":"emphasis","children":[{"type":"text","value":"Matif X, two paths are collapsed into a single group indicates too","key":"CgZNDrpHmF"}],"key":"yB91JZx0h1"}],"key":"CELeW6LUbX"},{"type":"paragraph","position":{"start":{"line":84,"column":0},"end":{"line":85,"column":0}},"children":[{"type":"text","value":"Relatively simple short motifs will produce synteny breakpoints but these four simple ones cover the majority of useful joinings. In the case of our example Thermus project the 8500 gene groups are reduced to around 7000 synteny islands. As such, the majority of the genes in a 100 strain project have fluctuating synteny. A few islands of essential genes have conserved gene order, largest of them being the 30S/50S gene island. Each island object is marked with the number of motifs of each type. This can be helpful when locating errors or specific behavior in the genome. Motif A for instance indicates an insert of gene of genes. Motif B might indicate a sequencing error where a contig is cut short and a gene doesn’t fall into its correct group, hence the split. In that case, the edge weight is low, preferably 1 strain. Otherwise motif B can show where a different family of genes are spliced into the same location in different species. Motif C is where genes or islands have swapped places in the genome order. No instance of the C motif was found in our Thermus project so it might not be a common event. The synteny graph can be exported to a .sif file readable by the Cytoscape graph visualization tool:","key":"S4P6I3TbBF"}],"key":"V9Ndir1Ll2"},{"type":"image","url":"/grein/build/cytoscape-35b17e1679354902ff9a4fd73c8dfb52.svg","alt":"cytoscape","title":"cytoscape","urlSource":"cytoscape.svg","key":"CgaQCW15X4"},{"type":"paragraph","position":{"start":{"line":88,"column":0},"end":{"line":89,"column":0}},"children":[{"type":"emphasis","children":[{"type":"text","value":"An example of genome synteny graph in Cytoscape. The replacement motif (A) is part of the island as the double gene groups within the motif had been joined in previous iteration.","key":"vU571xMZlA"}],"key":"gVzoCSCnCg"}],"key":"yctbBqFXTX"}],"key":"FOSZI0J3Hc"},{"type":"block","position":{"start":{"line":90,"column":0},"end":{"line":91,"column":0}},"children":[{"type":"heading","depth":4,"position":{"start":{"line":92,"column":0},"end":{"line":93,"column":0}},"children":[{"type":"text","value":"Phylogeny","key":"mfWbBA71ZG"}],"identifier":"phylogeny","label":"Phylogeny","html_id":"phylogeny","implicit":true,"key":"EAhjRFLcIE"},{"type":"paragraph","position":{"start":{"line":93,"column":0},"end":{"line":94,"column":0}},"children":[{"type":"text","value":"FastTree algorithm is used to create phylogeny of all the multiple alignments from the MSA steps from above with more than two sequences. Phylogeny of islands are generated by cancatenating aligned sequences from the groups within the island. The results are stored in .tre files in the project directory/zip file under the 'phylogeny' folder.","key":"CWEIlywLgg"}],"key":"IZOIMkHNKE"}],"key":"I8FYqx32tE"},{"type":"block","position":{"start":{"line":95,"column":0},"end":{"line":96,"column":0}},"children":[{"type":"heading","depth":4,"position":{"start":{"line":97,"column":0},"end":{"line":98,"column":0}},"children":[{"type":"text","value":"Additional annotation","key":"rnP0dQMpZo"}],"identifier":"additional-annotation","label":"Additional annotation","html_id":"additional-annotation","implicit":true,"key":"wXLCusL98I"},{"type":"paragraph","position":{"start":{"line":98,"column":0},"end":{"line":99,"column":0}},"children":[{"type":"text","value":"Geneset does functional annotation of all the genes using eggNOG. This process is also split into Spark tasks equal to the number of species by default. Geneset selectes the most abundant annotation from each group as long as it is not marked hypothetical gene. As hmmer profiles have been generated in the previous preprocessing step, the hmmer feature in eggNOG can be used. Genes that do not fall into a known group are marked an can be run on custom annotation pipelines such as hhpred. Additional columns can be added for custom annotations. If applicable, gene islands are annotated with a functional pathway id such as kegg id.","key":"fl8QUDeOVg"}],"key":"vsYXHJUZv6"}],"key":"lRilISZGy0"},{"type":"block","position":{"start":{"line":100,"column":0},"end":{"line":101,"column":0}},"children":[{"type":"heading","depth":3,"position":{"start":{"line":102,"column":0},"end":{"line":103,"column":0}},"children":[{"type":"text","value":"User interface","key":"bLmRlecvE0"}],"identifier":"user-interface","label":"User interface","html_id":"user-interface","implicit":true,"key":"uuZ36Su4Rs"},{"type":"paragraph","position":{"start":{"line":103,"column":0},"end":{"line":106,"column":0}},"children":[{"type":"text","value":"The procesessing and extra annotation can be run in headless mode. Geneset can be launched from the command line. Skipping arguments in the command line launches the GUI.\njava -jar geneset.jar\nGene group table The main application table is the gene group table. It has three main columns, \"Annotation\", \"Share id\" and \"Selection\" The first column is the common annotation for the gene group. To make accumulating selections, the table has the concepts of highlighting and selecting. The user can highlight rows in the table and store selections marked in the last \"selection\" column. The table can be cropped based on selection allowing for creating sub-projects.","key":"D00DM1MwOu"}],"key":"blsrQXotEh"},{"type":"paragraph","position":{"start":{"line":107,"column":0},"end":{"line":108,"column":0}},"children":[{"type":"strong","children":[{"type":"text","value":"Annotation","key":"MvsRctUAy4"}],"key":"ceNl31p0T0"},{"type":"text","value":": The most descriptive annotation from each set of genes is used as the default annotation in the Geneset table. That is, genes with annotation 'hypothetical gene' give way for other annotations in the set.","key":"bth96Rpk7G"}],"key":"MvN9NAnOzv"},{"type":"paragraph","position":{"start":{"line":109,"column":0},"end":{"line":110,"column":0}},"children":[{"type":"strong","children":[{"type":"text","value":"Sharing number","key":"JQg8UWYrRC"}],"key":"BBZyDCu0Tv"},{"type":"text","value":": Sharing id is given to each unique set of species/contigs. Each gene grouping is a member of one of these sets and gets that sharing id. By sorting the gene group table on the sharing id one can spot potential casettes of genes with distribution among the species in the sharing set","key":"SRxZhX9Jxi"}],"key":"Ibpx8chVrp"},{"type":"paragraph","position":{"start":{"line":111,"column":0},"end":{"line":113,"column":0}},"children":[{"type":"text","value":"Set selection dialog allows the user to select rows in the Gene group table based on pan genomics of a subset of the strains in a project. According to definitions in[1], the core genome is the set of genes present in all genomes. Shell genome are genes in two or more strains and cloud genome genes found in one strains. Accessory genome is the part of the pan genome the is not in the core, the shell and cloud genomes in essence. Softcore genome has also been defined as all sets with genes present in 95% of the strains in the project. The set selection dialog allows the user to define sets of gene groups adhering to a criteria, such as the core genome of a subset of the strains in the project (e.g. the members of one species). This feature enables the user to identify differences between strains and located genetic islands. The dialog lists the strains in the project and allow the user to run on the selected stains.\nCore selects all gene groups in the table that have genes in all of the selected strains. Exclusive core selects all gene groups in the table that have exclusively genes in all of the selected strains. Hence the gene group cannot contain genes from non selected strains Pan selects all gene groups in the table that have genes in at least one of the selected strains. Exclusive Pan selects all gene groups in the table that have genes in at least one of the selected strains but not in any of the non selected strains.","key":"ka101Y3iVc"}],"key":"mGSvXviynv"},{"type":"paragraph","position":{"start":{"line":114,"column":0},"end":{"line":116,"column":0}},"children":[{"type":"image","url":"/grein/build/setdiagram-e1a88f4072cf073399aa466276c7e8e8.svg","alt":"set diagram","title":"set diagram","urlSource":"setdiagram.svg","key":"YTEB1A0Gg8"},{"type":"text","value":"\nPan core selection diagram","key":"GE6NnJTALE"}],"key":"oHLboQOLvM"}],"key":"pr8lb9e3XO"},{"type":"block","position":{"start":{"line":117,"column":0},"end":{"line":118,"column":0}},"children":[{"type":"paragraph","position":{"start":{"line":119,"column":0},"end":{"line":121,"column":0}},"children":[{"type":"text","value":"The user selects all or part of the strains from the list, such as all members of a species. By using the core, pan and exclusive pan core genomes, most permutations of gene groups can be selected. For example the non-exclusive core is the core genome subtracted by the exclusive core genes.\nWith the Split merge dialog the user  can join or split selected rows in the Gene group table using a different criteria than used in the Gene clustering preprocessing step. Paralog genes are marked with darker color in the gene group table. Difference in the \"Group coverage\" and \"Group size\" columns can indicate paralog groups that can be split manually using the split merge dialog. A new identity value is given to make the split based on identity matrix from the MSA. Gene groups can also be manually merged if for instance a gene has been split in two because of sequencing or assembly errors.","key":"fGNTb6mAn2"}],"key":"zeXwGWTiyA"}],"key":"Jouvkf5dtB"},{"type":"block","position":{"start":{"line":122,"column":0},"end":{"line":123,"column":0}},"children":[{"type":"heading","depth":3,"position":{"start":{"line":124,"column":0},"end":{"line":125,"column":0}},"children":[{"type":"text","value":"Reporting","key":"ONJioxZtJj"}],"identifier":"reporting","label":"Reporting","html_id":"reporting","implicit":true,"key":"tN6eFgA1pj"},{"type":"paragraph","position":{"start":{"line":125,"column":0},"end":{"line":127,"column":0}},"children":[{"type":"text","value":"The Genome statistics report gives an overview of the genome size and number and types of annotations.\nAAI report gives an image showing the relationship between selected strains based on Average amino acid identity. The identity is calculated on the fly from the MSA. The ordering of the strains is based on neighbour-joining clustering.","key":"JElmKxNSSN"}],"key":"i0dU6N1YtJ"},{"type":"image","url":"/grein/build/aai-57dcd457a42cc6882c2ad31173b1b713.png","alt":"aai matrix","title":"aai matrix","urlSource":"aai.png","urlOptimized":"/grein/build/aai-57dcd457a42cc6882c2ad31173b1b713.webp","key":"mmFjb5HAc5"}],"key":"R1zmZC16cU"},{"type":"block","position":{"start":{"line":130,"column":0},"end":{"line":131,"column":0}},"children":[{"type":"paragraph","position":{"start":{"line":132,"column":0},"end":{"line":135,"column":0}},"children":[{"type":"text","value":"AAI showing two stains from 3 different species. Strains of the same species all have similarity higher the 95%\nVisualization Geneset has rich visualization features.\nXYPlot Geneset is based on joining sets of annotations on a sequence, e.g. genes. Each point in the XYPlot function in geneset is based on a gene homolog, as opposed to sequence motifs from programs such as Mummer. One can rearrange contigs manualy by dragging blocks in the XY grid. The automatic rearrange function uses the gene order from a related strains to rearrange contigs in a draft sequence","key":"sEvEve8sBG"}],"key":"ls9s9gQ8Es"}],"key":"eeKYQhfHLu"},{"type":"block","position":{"start":{"line":136,"column":0},"end":{"line":137,"column":0}},"children":[{"type":"heading","depth":3,"position":{"start":{"line":138,"column":0},"end":{"line":139,"column":0}},"children":[{"type":"text","value":"Conclusion","key":"lW7vnOHQ9U"}],"identifier":"conclusion","label":"Conclusion","html_id":"conclusion","implicit":true,"key":"XZOxG49QNU"},{"type":"paragraph","position":{"start":{"line":140,"column":0},"end":{"line":141,"column":0}},"children":[{"type":"text","value":"By leveraging Spark's distributed computing framework, Geneset harnesses the power of parallel processing and handles large-scale pan-genomics data with ease. Spark's comprehensive set of libraries, such as Spark SQL, Spark MLlib, and GraphX, offer a wide range of tools for data manipulation. These libraries provide pre-built functions and algorithms that can significantly speed up the development and implementation of complex pan-genomics analyses. Also, visualization capabilities make it easier for researchers and bioinformaticians to derive meaningful insights from their data.","key":"kRgUSJUnlu"}],"key":"m9nPagSDOn"}],"key":"cqt1jD4pUy"},{"type":"block","position":{"start":{"line":142,"column":0},"end":{"line":143,"column":0}},"children":[{"type":"heading","depth":3,"position":{"start":{"line":144,"column":0},"end":{"line":145,"column":0}},"children":[{"type":"text","value":"Availability of Source Code and Requirements","key":"bpCki1g1o6"}],"identifier":"availability-of-source-code-and-requirements","label":"Availability of Source Code and Requirements","html_id":"availability-of-source-code-and-requirements","implicit":true,"key":"OF5LcbQtUB"},{"type":"paragraph","position":{"start":{"line":146,"column":0},"end":{"line":147,"column":0}},"children":[{"type":"text","value":"Project name: Geneset: Apache Spark based toolbox for pan genomic analysis","key":"DxmXjgcyvp"}],"key":"ZpLoa5RDQi"},{"type":"paragraph","position":{"start":{"line":148,"column":0},"end":{"line":149,"column":0}},"children":[{"type":"text","value":"Project home page: ","key":"sZIEL1yEEe"},{"type":"link","url":"https://github.com/sigmarkarl/geneset","children":[{"type":"text","value":"https://​​github​​.com​​/sigmarkarl​​/geneset","key":"BmiG1ECObR"}],"urlSource":"https://github.com/sigmarkarl/geneset","error":true,"key":"LT8Qx3gbIs"}],"key":"lHfY0lNUUr"},{"type":"paragraph","position":{"start":{"line":150,"column":0},"end":{"line":151,"column":0}},"children":[{"type":"text","value":"Maven package repository: ","key":"rQ3EqigbHu"},{"type":"link","url":"https://raw.githubusercontent.com/sigmarkarl/geneset/java11/repo","children":[{"type":"text","value":"https://​​raw​​.githubusercontent​​.com​​/sigmarkarl​​/geneset​​/java11​​/repo","key":"vtYs4kvWcL"}],"urlSource":"https://raw.githubusercontent.com/sigmarkarl/geneset/java11/repo","key":"MeWXLptWhc"}],"key":"W4Z2uzJaNt"},{"type":"paragraph","position":{"start":{"line":152,"column":0},"end":{"line":153,"column":0}},"children":[{"type":"text","value":"Maven coordinates: org.simmi.geneset:distann:1.0.0","key":"F7wofM75l3"}],"key":"gBerTGPZ9B"},{"type":"paragraph","position":{"start":{"line":154,"column":0},"end":{"line":155,"column":0}},"children":[{"type":"text","value":"Programming language: Java","key":"yvkgiU2NSk"}],"key":"dsdmPF32w1"},{"type":"paragraph","position":{"start":{"line":156,"column":0},"end":{"line":157,"column":0}},"children":[{"type":"text","value":"Other requirements: Blast/Diamond, Mafft, fasttree, prodigal","key":"sxF9LUxbXR"}],"key":"TJ5SbhaRZc"},{"type":"paragraph","position":{"start":{"line":158,"column":0},"end":{"line":159,"column":0}},"children":[{"type":"text","value":"License: MIT","key":"DwJCKYY9kS"}],"key":"QgUMiGOGWh"}],"key":"E0EenuqVLM"},{"type":"block","position":{"start":{"line":160,"column":0},"end":{"line":161,"column":0}},"children":[{"type":"heading","depth":3,"position":{"start":{"line":162,"column":0},"end":{"line":163,"column":0}},"children":[{"type":"text","value":"Competing Interests","key":"vsvJEdTiUs"}],"identifier":"competing-interests","label":"Competing Interests","html_id":"competing-interests","implicit":true,"key":"GABqFBIbpW"},{"type":"paragraph","position":{"start":{"line":164,"column":0},"end":{"line":165,"column":0}},"children":[{"type":"text","value":"The authors declare that they have no competing interests","key":"VP9rSuwhRo"}],"key":"ruEZT73otW"}],"key":"bOzs6EdoIv"},{"type":"block","position":{"start":{"line":166,"column":0},"end":{"line":167,"column":0}},"children":[{"type":"heading","depth":3,"position":{"start":{"line":168,"column":0},"end":{"line":169,"column":0}},"children":[{"type":"text","value":"ACKNOWLEDGEMENTS","key":"xRHZDbfCVc"}],"identifier":"acknowledgements","label":"ACKNOWLEDGEMENTS","html_id":"acknowledgements","implicit":true,"key":"b9StoqPTXL"},{"type":"paragraph","position":{"start":{"line":170,"column":0},"end":{"line":171,"column":0}},"children":[{"type":"text","value":"We thank everyone who has contributed to the development of Geneset through testing and feedback.","key":"tHoGRxAhPO"}],"key":"yrltCrcaxa"}],"key":"SsAvmWCqEk"}],"key":"Wak2F7o9t0"},"references":{"cite":{"order":["Buchfink_2021","Katoh_2002","Price_2010"],"data":{"Buchfink_2021":{"number":1,"doi":"10.1038/s41592-021-01101-x","html":"Buchfink, B., Reuter, K., &amp; Drost, H.-G. (2021). Sensitive protein alignments at tree-of-life scale using DIAMOND. <i>Nature Methods</i>, <i>18</i>(4), 366–368. <a target=\"_blank\" rel=\"noreferrer\" href=\"https://doi.org/10.1038/s41592-021-01101-x\">10.1038/s41592-021-01101-x</a>"},"Katoh_2002":{"number":3,"doi":"10.1093/nar/gkf436","html":"Katoh, K. (2002). MAFFT: a novel method for rapid multiple sequence alignment based on fast Fourier transform. <i>Nucleic Acids Research</i>, <i>30</i>(14), 3059–3066. <a target=\"_blank\" rel=\"noreferrer\" href=\"https://doi.org/10.1093/nar/gkf436\">10.1093/nar/gkf436</a>"},"Price_2010":{"number":3,"doi":"10.1371/journal.pone.0009490","html":"Price, M. N., Dehal, P. S., &amp; Arkin, A. P. (2010). FastTree 2 – Approximately Maximum-Likelihood Trees for Large Alignments. <i>PLoS ONE</i>, <i>5</i>(3), e9490. <a target=\"_blank\" rel=\"noreferrer\" href=\"https://doi.org/10.1371/journal.pone.0009490\">10.1371/journal.pone.0009490</a>"}}}},"footer":{"navigation":{"next":{"title":"Geneset: Pan genome and synteny analysis of bacteria","url":"/myst/grein-1","group":"Geneset: Pan genome and synteny analysis of bacteria"}}},"domain":"http://localhost:3006","project":"myst"}